{
  "_name_or_path": "monologg/koelectra-small-v3-discriminator",
  "architectures": [
    "ElectraForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "embedding_size": 128,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 256,
  "id2label": {
    "0": "leave_of_absence",
    "1": "misc",
    "2": "curriculum",
    "3": "fa_general",
    "4": "academic_schedule",
    "5": "retake",
    "6": "scholarship",
    "7": "exchange_student",
    "8": "course_registration",
    "9": "tuition_fee"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "label2id": {
    "academic_schedule": 4,
    "course_registration": 8,
    "curriculum": 2,
    "exchange_student": 7,
    "fa_general": 3,
    "leave_of_absence": 0,
    "misc": 1,
    "retake": 5,
    "scholarship": 6,
    "tuition_fee": 9
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 4,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "torch_dtype": "float32",
  "transformers_version": "4.38.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 35000
}
