{
  "_name_or_path": "monologg/koelectra-small-v3-discriminator",
  "architectures": [
    "ElectraForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "embedding_size": 128,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 256,
  "id2label": {
    "0": "\uae30\ud0c0",
    "1": "\ucee4\ub9ac\ud058\ub7fc",
    "2": "\ub4f1\ub85d\uae08",
    "3": "\uc218\uac15\uc2e0\uccad",
    "4": "\ud559\uc0ac\uc77c\uc815",
    "5": "FA\uc81c\ub3c4",
    "6": "\ud734\ud559",
    "7": "\uc7ac\uc218\uac15",
    "8": "\uad50\ud658\ud559\uc0dd"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "label2id": {
    "FA\uc81c\ub3c4": 5,
    "\uad50\ud658\ud559\uc0dd": 8,
    "\uae30\ud0c0": 0,
    "\ub4f1\ub85d\uae08": 2,
    "\uc218\uac15\uc2e0\uccad": 3,
    "\uc7ac\uc218\uac15": 7,
    "\ucee4\ub9ac\ud058\ub7fc": 1,
    "\ud559\uc0ac\uc77c\uc815": 4,
    "\ud734\ud559": 6
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 4,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "torch_dtype": "float32",
  "transformers_version": "4.35.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 35000
}
