{
  "_name_or_path": "monologg/koelectra-small-v3-discriminator",
  "architectures": [
    "ElectraForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "embedding_size": 128,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 256,
  "id2label": {
    "0": "O",
    "1": "B-course",
    "2": "I-course",
    "3": "B-professor",
    "4": "I-professor",
    "5": "B-course_keyword",
    "6": "I-course_keyword",
    "7": "B-location",
    "8": "I-location",
    "9": "B-location_from",
    "10": "I-location_from",
    "11": "B-location_to",
    "12": "I-location_to",
    "13": "B-keyword",
    "14": "I-keyword"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "label2id": {
    "B-course": 1,
    "B-course_keyword": 5,
    "B-keyword": 13,
    "B-location": 7,
    "B-location_from": 9,
    "B-location_to": 11,
    "B-professor": 3,
    "I-course": 2,
    "I-course_keyword": 6,
    "I-keyword": 14,
    "I-location": 8,
    "I-location_from": 10,
    "I-location_to": 12,
    "I-professor": 4,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 4,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "torch_dtype": "float32",
  "transformers_version": "4.37.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 35000
}
